FSAndDisk_Test/FS_Disk_SSD_MP400_4TB_NVMe_scripts/mp4004TB_fs_fio_test_write_ranseq/rand_write_block_64k_4_64_jobs.out
rand_write_test: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 64 processes

rand_write_test: (groupid=0, jobs=64): err= 0: pid=2727763: Fri May 10 18:23:51 2024
  write: IOPS=12.5k, BW=778MiB/s (816MB/s)(200GiB/263178msec); 0 zone resets
    slat (usec): min=8, max=6830, avg=33.90, stdev=16.33
    clat (usec): min=106, max=72809, avg=5099.36, stdev=2499.76
     lat (usec): min=137, max=72857, avg=5133.76, stdev=2499.83
    clat percentiles (usec):
     |  1.00th=[ 2868],  5.00th=[ 2966], 10.00th=[ 3130], 20.00th=[ 3326],
     | 30.00th=[ 3720], 40.00th=[ 3916], 50.00th=[ 4146], 60.00th=[ 4490],
     | 70.00th=[ 5080], 80.00th=[ 6128], 90.00th=[ 9241], 95.00th=[10028],
     | 99.00th=[11863], 99.50th=[12518], 99.90th=[20055], 99.95th=[34341],
     | 99.99th=[43779]
   bw (  KiB/s): min=344960, max=1402127, per=100.00%, avg=797683.07, stdev=4733.83, samples=33652
   iops        : min= 5390, max=21884, avg=12450.88, stdev=73.91, samples=33652
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=42.61%, 10=52.13%, 20=5.13%, 50=0.10%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.33%, sys=0.78%, ctx=3277777, majf=0, minf=2517
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3276800,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=778MiB/s (816MB/s), 778MiB/s-778MiB/s (816MB/s-816MB/s), io=200GiB (215GB), run=263178-263178msec

Disk stats (read/write):
  nvme1n1: ios=0/3274688, merge=0/53, ticks=0/16589828, in_queue=16590824, util=100.00%

Test Time: 2024-05-10 18:23:51
Device Name: filetest.txt
Device Info: